{
  "backend/main.mo": "Implements a simple cooldown-based rate limiter using device IDs and timestamps to allow or deny actions. Provides functions to check and record actions with a 3‑minute cooldown.",
  "feature_evidence.json": "Defines a feature report describing a frontend change to load user-provided image URLs in VisualTrustSection at specified positions.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files including pages, layout components, sections, config, and utilities.",
  "frontend/index.css": "Defines global Tailwind layers and extensive CSS variables for light and dark themes, applying base background and border styles.",
  "frontend/index.html": "HTML entry point setting metadata, fonts, and root element, loading the main React script.",
  "frontend/src/App.tsx": "Configures TanStack Router with root layout and routes for home, privacy, and terms pages using environment-based base path.",
  "frontend/src/components/common/ImageWithFallback.tsx": "React image component that shows a gradient placeholder while loading or on error, preserving layout and preventing broken images.",
  "frontend/src/components/layout/Footer.tsx": "Footer with company info, links, social icons, and a rate-limited WhatsApp button using backend checks.",
  "frontend/src/components/layout/Navbar.tsx": "Sticky navbar with brand navigation, smooth scroll behavior, and responsive mobile drawer menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps all pages with a common layout containing the navbar, routed content, and footer.",
  "frontend/src/components/sections/AboutSection.tsx": "About section describing MagadhPrime's production quality, hygiene, and natural processing.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Displays four benefit cards highlighting organic sourcing, added bran, chemical-free processing, and hygienic quality.",
  "frontend/src/components/sections/HeroSection.tsx": "Landing hero with background image and WhatsApp order button including rate‑limit checks and error handling.",
  "frontend/src/components/sections/SupportSection.tsx": "Support form with validation, rate‑limit checks, and Google Forms submission plus success/error states.",
  "frontend/src/components/sections/VisualTrustSection.tsx": "Displays a grid of production‑process images with captions to build brand trust.",
  "frontend/src/components/sections/WhatsAppCTASection.tsx": "WhatsApp CTA section offering an order button with rate‑limit checking and error display.",
  "frontend/src/config/marketing.ts": "Central marketing config defining WhatsApp link, contact info, social URLs, address, and Google Forms settings.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity auth client, login flow, stored identity, and related status flags.",
  "frontend/src/hooks/usePageMeta.ts": "Hook that updates the document title and meta description when page metadata changes.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light/dark themes and custom utility classes.",
  "frontend/src/lib/assetUrl.ts": "Provides helpers to build correct asset URLs using Vite's BASE_URL, including generated assets.",
  "frontend/src/lib/deviceId.ts": "Generates and stores a persistent device UUID in localStorage with fallback for older browsers.",
  "frontend/src/lib/googleFormsSubmit.ts": "Submits contact form data to Google Forms using configured field mappings and no‑cors mode.",
  "frontend/src/lib/rateLimit.ts": "Checks frontend rate limits by querying the backend using a device‑scoped action identifier.",
  "frontend/src/lib/scrollToSection.ts": "Smoothly scrolls to a section by ID with an offset for a sticky header.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, applying global CSS.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage sections and handles hash‑based smooth scrolling with page metadata setup.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays the Privacy Policy content with page metadata configured.",
  "frontend/src/pages/TermsOfUsePage.tsx": "Displays the Terms of Use content with page metadata configured.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors mapped to CSS variables, typography, animations, and plugins.",
  "project_state.json": "Defines project configuration and architectural notes for building a mobile‑first marketing site with performance, SEO, image handling, and content rules, plus known issues and existing implemented features. Contains detailed constraints for visuals, navigation, and prohibited terminology."
}