{
  "backend/main.mo": "Implements a simple per-device cooldown using a map of last action timestamps and exposes functions to check or record actions.",
  "feature_evidence.json": "Defines a feature evidence report describing a hero-section background image update and its related file and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend source files, covering layout, pages, sections, and utilities.",
  "frontend/index.css": "Tailwind base styles defining color tokens, dark mode variants, and global background/foreground rules.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for home, privacy, and terms pages wrapped in a shared layout.",
  "frontend/src/components/common/ImageWithFallback.tsx": "Image component that shows a gradient placeholder during load or failure and resets state when the src changes.",
  "frontend/src/components/layout/Footer.tsx": "Footer with company info, links, social icons, and a WhatsApp button gated by backend rate-limit checks.",
  "frontend/src/components/layout/Navbar.tsx": "Responsive navbar with brand navigation and section scrolling supported by TanStack Router.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper rendering navbar, routed content outlet, and footer.",
  "frontend/src/components/sections/AboutSection.tsx": "About section describing MagadhPrime’s production quality and chemical-free processing.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Displays four benefit cards highlighting organic wheat, added bran, no chemicals, and hygiene-focused production.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with background image, product messaging, and a WhatsApp order button with rate‑limit checking.",
  "frontend/src/components/sections/SupportSection.tsx": "Support form collecting name, phone, and message with validation, rate‑limit checks, and Google Forms submission.",
  "frontend/src/components/sections/VisualTrustSection.tsx": "Displays a grid of production‑process images loaded via generated asset URLs.",
  "frontend/src/components/sections/WhatsAppCTASection.tsx": "CTA section prompting WhatsApp ordering with rate‑limit logic and error handling.",
  "frontend/src/config/marketing.ts": "Centralized marketing config defining WhatsApp link, contact info, social links, and Google Forms field IDs.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth context handling login, identity persistence, and status tracking using Dfinity AuthClient.",
  "frontend/src/hooks/usePageMeta.ts": "Hook that updates the page title and meta description on mount or change.",
  "frontend/src/index.css": "Tailwind base styles plus custom OKLCH color variables and utility classes for the site’s theme.",
  "frontend/src/lib/assetUrl.ts": "Utilities to build correct static asset URLs using Vite's base path, including helpers for generated assets.",
  "frontend/src/lib/deviceId.ts": "Generates and stores a persistent UUID in localStorage for per‑device identification.",
  "frontend/src/lib/googleFormsSubmit.ts": "Submits contact data to a configured Google Form using no‑cors POST and returns success/failure.",
  "frontend/src/lib/rateLimit.ts": "Checks rate limits via a backend actor using a device‑scoped action identifier and fails closed on errors.",
  "frontend/src/lib/scrollToSection.ts": "Smoothly scrolls to a DOM element by ID while offsetting for a sticky header.",
  "frontend/src/main.tsx": "App entry point mounting React with React Query and Internet Identity providers.",
  "frontend/src/pages/HomePage.tsx": "Home page assembling all marketing sections and handling hash‑based smooth scrolling with page metadata.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the Privacy Policy static content and sets page metadata.",
  "frontend/src/pages/TermsOfUsePage.tsx": "Renders the Terms of Use static content and sets page metadata.",
  "frontend/tailwind.config.js": "TailwindCSS configuration with custom colors, typography, container settings, and animations.",
  "project_state.json": "Project configuration describing site goals, architecture notes, known issues, and existing features."
}