{
  "backend/main.mo": "Implements a simple rate‑limit system storing last action timestamps per device and enforcing a 3‑minute cooldown.",
  "feature_evidence.json": "Contains a feature evidence report describing an update to load the first Visual Trust image from an external URL.",
  "frontend-file-summaries.txt": "Lists summaries of all frontend files, describing their roles in routing, sections, components, styling, and configuration.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH color variables for both light and dark themes.",
  "frontend/index.html": "HTML entry file that sets metadata, loads Google Fonts, and mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for home, privacy, and terms pages wrapped in a shared layout.",
  "frontend/src/components/common/ImageWithFallback.tsx": "Reusable image component that shows a gradient placeholder on load or error while preserving layout.",
  "frontend/src/components/layout/Footer.tsx": "Footer with company info, links, and a rate‑limited WhatsApp button using backend validation.",
  "frontend/src/components/layout/Navbar.tsx": "Sticky navbar supporting smooth section scrolling, responsive mobile sheet menu, and brand navigation.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper that displays the navbar, routed page content, and footer.",
  "frontend/src/components/sections/AboutSection.tsx": "About section describing MagadhPrime’s production quality and natural processing approach.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Benefits section showing four feature cards highlighting product quality and health advantages.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with background imagery and a WhatsApp order button that checks rate limits before opening the link.",
  "frontend/src/components/sections/SupportSection.tsx": "Support form with validation, rate‑limit checking, and Google Forms submission logic.",
  "frontend/src/components/sections/VisualTrustSection.tsx": "Displays a grid of production‑related images, using local or external asset URLs.",
  "frontend/src/components/sections/WhatsAppCTASection.tsx": "CTA section offering a WhatsApp order button with rate‑limit enforcement and error handling.",
  "frontend/src/config/marketing.ts": "Centralized marketing config including WhatsApp link generation, email, social links, address, and Google Forms IDs.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous backend actor, refreshing when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, login, logout, and stored identities.",
  "frontend/src/hooks/usePageMeta.ts": "Hook that updates document title and meta description on mount or when inputs change.",
  "frontend/src/index.css": "Tailwind setup with custom color variables, theme layers, dark mode overrides, and utility classes.",
  "frontend/src/lib/assetUrl.ts": "Builds normalized asset URLs using Vite's BASE_URL, plus a helper for generated assets.",
  "frontend/src/lib/deviceId.ts": "Creates and stores a persistent per-device UUID in localStorage for identification.",
  "frontend/src/lib/googleFormsSubmit.ts": "Submits contact data to Google Forms using configured field mappings with no‑cors fetch.",
  "frontend/src/lib/rateLimit.ts": "Checks frontend rate limits via backend actor using a device‑scoped action identifier.",
  "frontend/src/lib/scrollToSection.ts": "Smoothly scrolls to a DOM section by ID with a fixed header offset.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and mounts App.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage sections and applies metadata plus hash‑based smooth scrolling.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays the full Privacy Policy with headings, structured text, and page metadata.",
  "frontend/src/pages/TermsOfUsePage.tsx": "Displays the Terms of Use content with structured sections and page metadata.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling typography, container queries, animations, and theme extensions.",
  "project_state.json": "JSON project state describing requirements, architecture notes, known issues, and existing features."
}