{
  "kind": "build_request",
  "title": "Update Visual Trust first image to use provided external URL",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "Update the Visual Trust section so that the first image in the grid loads from the external URL \"https://i.postimg.cc/DfNT4zDB/IMG-20260214-041839.png\" instead of the current generated asset filename, while keeping all other Visual Trust images unchanged and preserving the existing layout and ImageWithFallback behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Replace the url in visual trust section of first image.\n1. https://i.postimg.cc/DfNT4zDB/IMG-20260214-041839.png"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/components/sections/VisualTrustSection.tsx, the first Visual Trust image renders using src=\"https://i.postimg.cc/DfNT4zDB/IMG-20260214-041839.png\" (not passed through getGeneratedAssetUrl).",
        "All other Visual Trust images continue to load from their existing generated asset filenames via getGeneratedAssetUrl.",
        "The Visual Trust grid layout, aspect ratio, hover effects, and ImageWithFallback loading/fallback UI remain unchanged.",
        "The change does not affect the Hero section image behavior or any other site images."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited (including frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui).",
    "Keep the existing Visual Trust section styling and structure; only change the first image source URL as requested."
  ],
  "nonGoals": [
    "Do not regenerate or modify any existing generated WebP assets for the Visual Trust section.",
    "Do not change any other Visual Trust image URLs/filenames or alt text beyond what is required to update the first image source."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}